[{"bio":"","isDeprecated":false,"name":"","publicName":"","sessions":["518","519"],"sortGroup":"*","sortKey":"*","speakerId":137},{"bio":"Mustapha is a Qt C++ programmer. He is working with the translation project of KDE Desktop Environment into HAUSA Language and had the opportunity to participate in KDE aKademy in 2008.\r\n\r\nMustapha and Nasiru are the key organizers of the first international conference on free and open source software in Nigeria which took place at Bayero University Kano (BUK) in collaboration with HUTSOFT Nigeria with more than 500 participants in 2009 and 2010.","isDeprecated":false,"name":"Mustapha Abubakar","publicName":"","sessions":["426"],"sortGroup":"A","sortKey":"ABUBA","speakerId":437},{"bio":"Google Summer of Code 2015, Google Summer of Code 2016 Mentor, Google Code-In 2015 Mentor and Season of KDE Mentor","isDeprecated":false,"name":"Sagar Chand Agarwal","publicName":"","sessions":["339"],"sortGroup":"A","sortKey":"AGARW","speakerId":594,"speakerImage":594},{"bio":"Laszlo is a senior software engineer at The Qt Company in Oslo, Norway. After years of UI framework development on various Nokia mobile platforms and developing mobile GPUs at ARM, he is now working full time on Qt. His focus is on graphics and windowing system integrations, in particular on devices running Embedded Linux. However, in a true cross-platform Qt spirit, he is not afraid of other platforms either. He is a major contributor to QtGui, QtQuick, and is the maintainer of the embedded-focused linuxfb and eglfs platform plugins.","isDeprecated":false,"name":"Laszlo Agocs","publicName":"","sessions":["348","327"],"sortGroup":"A","sortKey":"AGOCS","speakerId":653},{"bio":"Erik Albers is with the FSFE since 2012, is the community builder of FSFE and knows its tools by heart. You meet Erik regularly at various booths in Europe, in Berlin's local group meetings, in the FSFE office or visiting other Fellows and local groups, so he also knows the needs of our community.","isDeprecated":false,"name":"Erik Albers ","publicName":"","sessions":["761","762"],"sortGroup":"A","sortKey":"ALBER","speakerId":1451,"speakerImage":1451},{"bio":"","isDeprecated":false,"name":"Nicolás Alvarez","publicName":"","sessions":["583"],"sortGroup":"A","sortKey":"ALVAR","speakerId":25},{"bio":"Sandro Andrade is a professor at Federal Institute of Education, Science, and Technology of Bahia (IFBA) - Brazil. He holds a PhD in Computer Science and has been involved in projects with C++ since 1996 and has nearly 14 years of experience with Qt development. Since 2008, Sandro has been doing contributions in coding, promotion, and community management for KDE.","isDeprecated":false,"name":"Sandro Andrade","publicName":"","sessions":["424"],"sortGroup":"A","sortKey":"ANDRA","speakerId":541,"speakerImage":541},{"bio":"Paolo Angelelli is a software engineer at The Qt Company in Oslo. He's passionate about Qt, graphics and multimedia and his current focus is on QtLocation.\r\nHe has a background in scientific visualization. \r\nIn his spare time he enjoys tennis and hacking together Qt applications.","isDeprecated":false,"name":"Paolo Angelelli","publicName":"","sessions":["394"],"sortGroup":"A","sortKey":"ANGEL","speakerId":695},{"bio":"Although working more with people than computers in his daily job, Guido has been a passionate Free Software user since 1999 and was the coordinator for German translations at gnu.org from 2001 until 2003. After completing night school in 2006, he was ready to get active for Free Software again and got gradually involved in FSFE activities: first translations, helping at booths, coordinating the Fellowship group Rhein/Main (Frankfurt).  Today, he spends his available time (read: time awake while his two kids are fast asleep) to FSFE's education team.\r\n","isDeprecated":false,"name":" Guido  Arnold","publicName":"","sessions":["752"],"sortGroup":"A","sortKey":"ARNOL","speakerId":1349,"speakerImage":1349},{"bio":"I am Jona, a third year student of Business Informatics at University of Tirana. Meanwhile I am a member of Open Labs Hackerspace where i am involved in many open source projects we promote there like GNU/Linux, LibreOffice, Mozilla, Wikipedia, OpenStreetMap etc, and also co-organiser of Open Source Conference Albania (OSCAL). I am also part of Fedora Project and I am the first Fedora Ambassador in Albania. I've participated in different conferences (the latest is DORS CLUC conference) representing womens in Fedora Project, the way we deal with this huge gender gap and the steps we've taken to reduce it. ","isDeprecated":false,"name":"Jona Azizaj","publicName":"","sessions":["462"],"sortGroup":"A","sortKey":"AZIZA","speakerId":818},{"bio":"Eric Bader is a Product Manager at Esri, Inc., located in Redlands California. He manages the ArcGIS Runtime SDK products for Qt, Java and Android. He has over 25 years of professional GIS experience. He has been at Esri since 1991, during which time he has served in many GIS technical roles, including technical consultant, developer evangelist, software developer, product engineer and technical product manager. ","isDeprecated":false,"name":"Eric Bader","publicName":"","sessions":["379"],"sortGroup":"B","sortKey":"BADER","speakerId":690,"speakerImage":690},{"bio":"Miriam Ballhausen works as Attorney at Law at JBB Rechtsanwälte, a Berlin-based law firm specialised in IT/IP law. At JBB Rechtsanwälte Miriam Ballhausen especially advises clients on Open Source License Compliance and helps developers and rightholders enforce open source license, especially the GPL in Germany. Since joining JBB Rechtsanwälte in 2012 Miriam Ballhausen has been successfully involved in various GPL enforcement cases.","isDeprecated":false,"name":"Miriam Ballhausen","publicName":"","sessions":["440"],"sortGroup":"B","sortKey":"BALLH","speakerId":821},{"bio":"","isDeprecated":false,"name":"Hugo Beauzée-Luyssen","publicName":"","sessions":["499","748"],"sortGroup":"B","sortKey":"BEAUZ","speakerId":979},{"bio":"Cellini Bedi is the new intern for the Free Software Foundation Europe since June 2016. She is currently completing her masters in Anthropology in Lyon, France. Her specialization on her on-going thesis is about digital anthropology. ","isDeprecated":false,"name":"Cellini Bedi","publicName":"","sessions":["762"],"sortGroup":"B","sortKey":"BEDI","speakerId":715,"speakerImage":715},{"bio":"Pradeepto Bhattacharya was the founder of KDE India. He has contributed to KDE in different ways - code & community. Previously he has served as a Director in the KDE e.V. Board. He has been organising conf.kde.in either as the main organiser or as a mentor since 2011. Previously he has been spreading the word of KDE across India by speaking at various conferences and universities.\r\n\r\nHe works for Red Hat Technologies as member of the newly formed Developer Tools Engineering Group. He lives with his wife in Pune.","isDeprecated":false,"name":"Pradeepto Bhattacharya","publicName":"","sessions":["427"],"sortGroup":"B","sortKey":"BHATT","speakerId":112},{"bio":"KDE dinosaur. ThreadWeaver developer. Organised 2 Akademies. Author of the KDE e.V. statutes.","isDeprecated":false,"name":"Mirko Boehm","publicName":"","sessions":["464","434"],"sortGroup":"B","sortKey":"BOEHM","speakerId":134,"speakerImage":134},{"bio":"23 years old, KDE Plasma core developer, working as a software developer with focus on QML-based apps for iOS, Android, and other thriving mobile platforms.","isDeprecated":false,"name":"Kai Uwe Broulik","publicName":"","sessions":["409"],"sortGroup":"B","sortKey":"BROUL","speakerId":398},{"bio":"Paul Brown has worked as a tech journalist, specialising in Internet trends \r\nand Free Software, for over twenty years. He started writing for the Spanish \r\ncounter-cultural/hacker magazine @RROBA in 1996, and from there moved on as \r\nwriter, editor, and later, editor-in-chief for several magazines both in \r\nSpanish and English, always in the realm of Free Software technology; he has \r\ncontributed articles to Linux Magazine International, Raspberry Pi Geek, \r\nOCSmag.com, and many other print and online publications. He also advises Free Software companies and organisations on how to improve their communication.\r\n","isDeprecated":false,"name":"Paul  Brown","publicName":"","sessions":["717"],"sortGroup":"B","sortKey":"BROWN","speakerId":1353},{"bio":"Andi started to be Freifunker in 2006 in Weimar. He is active in the freifunk.net webteam and board member of Förderverein freie Netzwerke. He works as software developer and database specialist in software projects. ","isDeprecated":false,"name":"Andrea Bräu","publicName":"","sessions":["457"],"sortGroup":"B","sortKey":"BRÄU","speakerId":840},{"bio":"After I studied scientific programming and worked in two small software companies in the telecommunication and pharma sector I continued studying information systems engineering in Aachen and started a scientific career. I'm enthusiastic about visualization, OpenGL and virtual reality. My work as a scientific assistant at FH Aachen consists of developing custom 3D renderers for industry partners and research in the fields of visualization and robotics.","isDeprecated":false,"name":"Daniel Bulla","publicName":"","sessions":[],"sortGroup":"B","sortKey":"BULLA","speakerId":691},{"bio":"","isDeprecated":false,"name":"Ronald Bultje","publicName":"","sessions":["500"],"sortGroup":"B","sortKey":"BULTJ","speakerId":1284},{"bio":"Hanno Böck started the Fuzzing Project in 2014 as an effort to improve the security of free software code. In May the Linux Foundation's Core Infrastructure Initiative decided to fund this work. The speaker Hanno Böck is working as a freelance journalist and regularly writes about IT security issues for various publications. ","isDeprecated":false,"name":"Hanno Böck","publicName":"","sessions":["467"],"sortGroup":"B","sortKey":"BÖCK","speakerId":1068},{"bio":"The author has studied information technology at the Clausthal University of Technology and has been a passionate hardware hacker for more than 10 years now. Professionally, he is working in the field of microwave/radio engineering. He is currently an active member and co-coordinator of the Franken FSFE local group.","isDeprecated":false,"name":"Christian Carlowitz","publicName":"","sessions":["471"],"sortGroup":"C","sortKey":"CARLO","speakerId":1357},{"bio":"Marco is a free software enthusiastic, he is translating with the Italian\r\ntranslation group of fsf 'Introduction to the command line', and follows\r\nthe RepRap Project since the early years. He follows the third industrial\r\nrevolution closely since he believes that empowering the people is the way\r\nto go.","isDeprecated":false,"name":"Marco  Celagero","publicName":"","sessions":["755"],"sortGroup":"C","sortKey":"CELAG","speakerId":1381},{"bio":"Helio Chissini de Castro is Software Integrator Engineer from BMW CarIT software development and long time KDE contributor. At BMW CarIT is working right now on the LSi team, Linux Software Integration, in the enablement of QtCreator as main IDE to drive the personalized SDK for future projects.","isDeprecated":false,"name":"Helio Chissini de Castro","publicName":"","sessions":["414"],"sortGroup":"C","sortKey":"CHISS","speakerId":158},{"bio":"I am the maintainer of the free search engine software YaCy.net <http://yacy.net/> and I started to publish software with the GPL license in 2004. I have a Master of Computer Science degree and work as freelance consultant since 2000. Since 2008 my professional work has a relation to the free software I published. I created the first architecture for the German Digital Library because of my work for free software and I design and develop search engines for Universities, Government and Companies. ","isDeprecated":false,"name":"Michael Christen ","publicName":"","sessions":["740"],"sortGroup":"C","sortKey":"CHRIS","speakerId":824},{"bio":"","isDeprecated":false,"name":"Alex Converse","publicName":"","sessions":["501"],"sortGroup":"C","sortKey":"CONVE","speakerId":985},{"bio":"Andreas is a KDE developer for about 5 years. His contributions mostly go into KDE Edu, where he maintains Rocs and Artikulate. Since last year he provides a development environment Docker Image for Android cross-compiling and made several KF5 libraries ready for use on Android.","isDeprecated":false,"name":"Andreas Cord-Landwehr","publicName":"","sessions":["415"],"sortGroup":"C","sortKey":"CORD-","speakerId":48},{"bio":"I am Cryptie from Paris, France. I am deputy coordinator translations (French). I joined the Fellowship in May 2012 and started to translate into French for the FSFE in june 2012. I am also a regular volunteer at FSFE Booths at FOSDEM and RMLL since 2013. Outside from Free Software, I am mainly involved in cryptography and privacy.","isDeprecated":false,"name":"Cryptie  ","publicName":"","sessions":["757"],"sortGroup":"C","sortKey":"CRYPT","speakerId":1032},{"bio":"Hacker, Free Software and crypto evangelist, privacy expert. Member of Warsaw Hackerspace and Panoptykon Foundation,host of Warsaw CryptoParty","isDeprecated":false,"name":"Michal Czyzewski","publicName":"","sessions":["484"],"sortGroup":"C","sortKey":"CZYZE","speakerId":812},{"bio":"Giuseppe holds a BSc in Computer Science. He is a long time contributor to Qt, having used Qt since 2000, and an Approver in the Qt Project. In KDAB, Giuseppe is a Senior Software Engineer and a Trainer, working on a number of C++ and QML projects, most of them requiring OpenGL knowledge. His contributions to Qt range from containers and regular expressions to GUI and OpenGL. A free software passionate, before joining KDAB, he organized conferences on opensource around Italy, especially about Perl.","isDeprecated":false,"name":"Giuseppe D'Angelo","publicName":"","sessions":["373","387"],"sortGroup":"D","sortKey":"D'ANG","speakerId":686},{"bio":"Bruno is an application developer at Mapbox. Open source enthusiast, Bruno has contributed to various upstream projects like KDE, WebKit and Servo for Samsung and Nokia. Thiago is a performance and embedded expert at Mapbox. Before joining Mapbox, Thiago tuned major browsers for the Intel platform and developed Qt phones at Nokia.","isDeprecated":false,"name":"Bruno de Oliveira Abinader","publicName":"","sessions":["350"],"sortGroup":"D","sortKey":"DE OL","speakerId":665,"speakerImage":665},{"bio":" Long time user of Linux and other open source software. Former European Commission official (retired). After a series of operational responsibilities (user support, email, networking, application development), leader of the team responsible for the IDABC (http://ec.europa.eu/idabc/) programme. ","isDeprecated":false,"name":"Karel  De Vriendt ","publicName":"","sessions":["453"],"sortGroup":"D","sortKey":"DE VR","speakerId":825},{"bio":"","isDeprecated":false,"name":"Albert Dengg","publicName":"","sessions":["759"],"sortGroup":"D","sortKey":"DENGG","speakerId":1354,"speakerImage":1354},{"bio":"Roberto Di Cosmo holds a PhD in Computer Science and is currently Computer Science professor at University Paris Diderot, after teaching for almost a decade at Ecole Normale Supérieure in Paris, and spending a few years at INRIA. He has been actively involved in research in theoretical computing, specifically in functional programming, parallel and distributed programming, the semanticsof programming languages, type systems, rewriting and linear logic. He focus now on new scientific problems posed by the general adoption of Free Software, with a particular focus on static analysis of large software collections, that were at the core of the european reseach project Mancoosi. Following the evolution of our society under the impact of IT with great interest, he is a long term Free Software advocate, contributing to its adoption since 1998 with the best-seller Hijacking the world, seminars, articles and software. He has created the Free Software thematic group of Systematic in October 2007, and is the director of IRILL, a research structure dedicated to Free and Open Source Software quality. Roberto leads the Software Heritage initiative. ","isDeprecated":false,"name":"Roberto Di Cosmo","publicName":"","sessions":["466"],"sortGroup":"D","sortKey":"DI CO","speakerId":816},{"bio":"Dimi is a Bulgarian political scientist who currently works as Free Knowledge Ambassador of the Wikimedia Movement to the EU. He is based in Brussels where his major focus is to „fix copyright”. ","isDeprecated":false,"name":"Dimitar Dimitrov","publicName":"","sessions":["454"],"sortGroup":"D","sortKey":"DIMIT","speakerId":811},{"bio":"David Edmundson is a long time KDE hacker currently working for Blue Systems. David is now an active maintainer of the Plasma desktop.","isDeprecated":false,"name":"David Edmundson","publicName":"","sessions":["421","401"],"sortGroup":"E","sortKey":"EDMUN","speakerId":150},{"bio":"When I started this project on the year 2010 little did I know I would end up battling city councils and companies to release their data as public feeds, nor I could imagine pybikes [3] was going to help create apps for all platforms [4] without having to code a single line. ","isDeprecated":false,"name":"Lluis Esquerda ","publicName":"","sessions":["483"],"sortGroup":"E","sortKey":"ESQUE","speakerId":820},{"bio":" On one hand, software is becoming the key element for more and more businesses. On the other hand, the price for software has never been lower. In addition, today it is increasingly provisioned through the World Wide Web and cloud computing in the form of services rather than products. The successful establishment of base technologies, platforms and associated business ecosystems therefore plays an increasingly important role in the context of software. ","isDeprecated":false,"name":"Steffen Evers","publicName":"","sessions":["447"],"sortGroup":"E","sortKey":"EVERS","speakerId":832},{"bio":"David Faure, very-long-time KDE developer (some say \"dinosaur\").\r\nMaintainer of many parts of the KDE frameworks (component technology, network\r\ntransparency, compression file formations, applications cache)\r\nand contributes to Qt 5 as needed by the KDE frameworks.\r\n","isDeprecated":false,"name":"David Faure","publicName":"","sessions":["326"],"sortGroup":"F","sortKey":"FAURE","speakerId":314,"speakerImage":314},{"bio":"Emanuel Feld is a Washington, DC-based environmental policy researcher turned technologist. He volunteers with the local Code for America brigade (often building tools for the public library) and, most recently, worked on open data policy, evangelized open source, and wrote code with the DC government's innovation unit. Previously, he lived in Cambodia, where he helped build out the country's first open data NGO. He's trying to pick up German again, which he last studied in middle school! ","isDeprecated":false,"name":"Emanuel Feld","publicName":"","sessions":["452"],"sortGroup":"F","sortKey":"FELD","speakerId":809},{"bio":"My name is Àlex Fiestas, I have been working at KDE for 7 years mostly\r\nwriting code in many different areas as well as in social endeavors like organizing sprint and other events.\r\n\r\nCurrently I find myself working as an architect at Open365, a cloud platform designed to compete with the likes of Google Docs/Office365 where we mix Web and Desktop technologies to achieve it.","isDeprecated":false,"name":"Àlex Fiestas","publicName":"","sessions":["418"],"sortGroup":"F","sortKey":"FIEST","speakerId":7,"speakerImage":7},{"bio":"MuseScore CTO and co-founder. Software architect. Desktop, web & mobile. FLOSS advocate. Drummer. ","isDeprecated":false,"name":"Nicolas Froment","publicName":"","sessions":["374"],"sortGroup":"F","sortKey":"FROME","speakerId":667,"speakerImage":667},{"bio":"Software engineer at KDAB, Kevin has actively developed with Qt since 2006 and has a special interest in tooling and profiling. An active contributor to KDAB's GammaRay analyzer, state machine tooling, Kevin is responsible for the Continuous Integration System within KDAB. He's one of the lead developers of the KDevelop IDE, and is pushing for cross-platform success inside KDE. Kevin holds a Masters Degree in Computer Science","isDeprecated":false,"name":"Kevin Funk","publicName":"","sessions":["378"],"sortGroup":"F","sortKey":"FUNK","speakerId":231},{"bio":"Using and contributing to Free Software and Open Data since more than 15 years in 2009 I started to organize the annual Randa Meetings. Beneath Akademy these are the biggest sprints or meetings KDE organizes. Personally I have a Master's degree in education, computer sciences and computational linguistics, working as a teacher and webmaster and am married and a father of 1 and 4 years old sons.","isDeprecated":false,"name":"Mario Fux","publicName":"","sessions":["423"],"sortGroup":"F","sortKey":"FUX","speakerId":403},{"bio":"Passionate of new technologies, focused on wearable devices powering them with artificial intelligence I'm a sport man and proud dad.\r\nhttps://www.linkedin.com/in/sebastianogalazzo","isDeprecated":false,"name":"Sebastiano Galazzo","publicName":"","sessions":["345"],"sortGroup":"G","sortKey":"GALAZ","speakerId":671},{"bio":" Peter Ganten is CEO of Univention, the company he founded in 2002. Together with the incredible team at Univention Peter has made it possible for thousands of organizations world wide to successfully use Open Source software. Peter is also the chairman of the Open Source Business Alliance, which is the Open Source business association in the German-speaking area. ","isDeprecated":false,"name":"Peter  Ganten","publicName":"","sessions":["441"],"sortGroup":"G","sortKey":"GANTE","speakerId":802},{"bio":"Sebastian is a malware researcher and security teacher. He did his PhD on the detection of botnets/malware by analyzing their network traffic and creating behavioral models of their actions.","isDeprecated":false,"name":"Sebastien Garcia","publicName":"","sessions":["750"],"sortGroup":"G","sortKey":"GARCI","speakerId":1346,"speakerImage":1346},{"bio":"Karsten Gerloff works in Open Source Governance at Siemens Corporate Technology, supporting one of the world's largest engineering firms in engaging profitably with Free Software. From 2009 to 2015, he was the president of the Free Software Foundation Europe, where he led the organisation's work to put users in control of technology. As an activist, Karsten has a decade's worth of experience in representing the Free Software community's interests towards policy makers, businesses and the general public. ","isDeprecated":false,"name":"Karsten  Gerloff","publicName":"","sessions":["449"],"sortGroup":"G","sortKey":"GERLO","speakerId":799,"speakerImage":799},{"bio":"Olivier Goffart started working with Qt 15 years ago with his involvement in KDE.\r\nHe was then hired by Trolltech to work on Qt in 2007.\r\nHe has been working on various areas of Qt including the itemview framework, the widget stylesheets, QtScript,\r\nthe QObject internals, and the QML debugger for Creator.\r\nHe is now the co-founder of Woboq, a company based in Berlin focusing on Qt","isDeprecated":false,"name":"Olivier Goffart","publicName":"","sessions":["361"],"sortGroup":"G","sortKey":"GOFFA","speakerId":254},{"bio":" Georg Greve is an entrepreneur and strategist. Currently CEO and president of the board at Kolab Systems AG. Previously he was founding president of the Free Software Foundation Europe (FSFE), initiated the battle against OOXML, consulted Google and various governments and has been writing for a long time, and in 2009 received the Federal Cross of Merit on Ribbon for his work for Open Standards and Free Software. ","isDeprecated":false,"name":"Georg Greve","publicName":"","sessions":["458"],"sortGroup":"G","sortKey":"GREVE","speakerId":804},{"bio":"I'm a software engineer at Red Hat where my responsibility is to maintain KDE and Qt in Red Hat Enterprise Linux and Fedora. I also contribute to few KDE projects related to NetworkManager and ModemManager support in KDE.","isDeprecated":false,"name":"Jan Grulich","publicName":"","sessions":["393"],"sortGroup":"G","sortKey":"GRULI","speakerId":96},{"bio":"Martin Gräßlin is a KDE developer since 2008 with primary focus on the window manager and compositor of the KDE Plasma workspaces, KWin. He is employed by BlueSystems GmbH to work on KWin and Plasma.","isDeprecated":false,"name":"Martin Gräßlin","publicName":"","sessions":["324"],"sortGroup":"G","sortKey":"GRÄSSL","speakerId":46},{"bio":"","isDeprecated":false,"name":"Thomas Guillem","publicName":"","sessions":["499"],"sortGroup":"G","sortKey":"GUILL","speakerId":1027},{"bio":"I'm generally a bumbling idiot who's driven by occasional bursts of inspiration to lay down code that does something useful. I dabble in analog electronics, like learning new languages (human languages too) and am a transit nerd.","isDeprecated":false,"name":"Boudhayan Gupta","publicName":"","sessions":["583"],"sortGroup":"G","sortKey":"GUPTA","speakerId":636,"speakerImage":636},{"bio":"Dr Sean Harmer holds a Ph.D. in Astrophysics and a Master of Science degree in Mathematics & Astrophysics. Sean has been developing with C++ and Qt since 1998 and in a commercial setting since 2003. Sean has been involved in  developing software in many areas including engineering, safety & risk, oil & gas, visualization and numerical simulations. Sean is the maintainer of Qt 3D and is currently heading up operations at KDAB UK where he is regularly involved in the development of Qt 5, the QNX port of Qt, OpenGL, and presenting professional Qt and OpenGL training courses. Sean is a keen swimmer, tea drinker and curry eater.","isDeprecated":false,"name":"Sean Harmer","publicName":"","sessions":["397","529"],"sortGroup":"H","sortKey":"HARME","speakerId":696},{"bio":"Senior Software Engineer at KDAB focused on software architecture and craftsmanship, who has found his love in Qt during the Maemo project.","isDeprecated":false,"name":"Mathias Hasselmann","publicName":"","sessions":["437"],"sortGroup":"H","sortKey":"HASSE","speakerId":711},{"bio":"","isDeprecated":false,"name":"Simon Hausmann","publicName":"","sessions":["430"],"sortGroup":"H","sortKey":"HAUSM","speakerId":700},{"bio":"When I was a kid I wanted to understand how computers work. Later I also\r\nwanted to understand how society works. This brought me (among other\r\nthings) to the struggle for software freedom and against surveillance.\r\nI currently live in Berlin and work as an assistant researcher in\r\nbioinformatics.","isDeprecated":false,"name":"Hannes  Hauswedell","publicName":"","sessions":["722"],"sortGroup":"H","sortKey":"HAUSW","speakerId":1355,"speakerImage":1355},{"bio":"Johan is a software engineer at The Qt Company in Oslo, Norway. Since February 2016 he has been working with the graphics team on the QtWayland module. He has previously worked in IT consulting for Bekk Consulting AS. Johan holds a M. Sc. degree in computer science from the Norwegian University of Science and Technology (NTNU).","isDeprecated":false,"name":"Johan Helsing","publicName":"","sessions":["392"],"sortGroup":"H","sortKey":"HELSI","speakerId":694},{"bio":"Ulf Hermann has been working at Digia and the Qt Company since 2013, mostly on tooling integration between Qt and Qt Creator, with a special focus on the QML profiler.","isDeprecated":false,"name":"Ulf Hermann","publicName":"","sessions":["436"],"sortGroup":"H","sortKey":"HERMA","speakerId":674},{"bio":"Gijs Hillenius is the expert team leader and senior editor for the European Commission’s Open Source Observatory & Repository (OSOR.eu), part of Joinup.ec.europa.eu. He's been involved with the OSOR since early 2007. ","isDeprecated":false,"name":"Gijs Hillenius ","publicName":"","sessions":["455"],"sortGroup":"H","sortKey":"HILLE","speakerId":833},{"bio":"Tobias Hunger works for The Qt Company on Qt Creator.","isDeprecated":false,"name":"Tobias Hunger","publicName":"","sessions":["435"],"sortGroup":"H","sortKey":"HUNGE","speakerId":709,"speakerImage":709},{"bio":"Paul started supporting the FSFE web team in 2012 as a freelance employee and\r\nhas gradually taken over the maintenance of various sytems. In his other jobs\r\nhe is writing in-house software for a childrens circus and runs a GNU/Linux\r\ncomputer room in a youth club, giving programming lessons to kids and\r\nmaintaining a workshop environment for Free Software and Free Culture\r\nactivists. Naturally he is working exclusively with Free Software in all his\r\nactivities.","isDeprecated":false,"name":"Paul  Hänsch  ","publicName":"","sessions":["754"],"sortGroup":"H","sortKey":"HÄNSC","speakerId":1380},{"bio":"Dan, or Leinir as they are known to most, has been an active part of the KDE community for about a decade, through their time at university, which resulted in a Master's degree in Information Technology specialising in Game and Engine Programming. While still at university, they were headhunted to work on the openDesktop.org content distribution network, as a part of the Bretzn project. More recently they were a part of the Calligra team which cooperated with Intel on the creation of Calligra Gemini, an office suite designed for use with multi form factor devices, and which they are now the official maintainer of. After the conclusion of that project, they were hired by blue systems to begin work on Shashlik, and after a while of working on that moved onto building the Peruse comic book reader. Outside of employment, they have worked on the Amarok and GamingFreedom.org projects, and outside of KDE is an author of science fiction and not too shabby when it comes to knocking up a bit of food.","isDeprecated":false,"name":"Dan Leinir Turthra Jensen","publicName":"","sessions":["381"],"sortGroup":"J","sortKey":"JENSE","speakerId":549,"speakerImage":549},{"bio":"Morten has been developing C++ and Qt for 10 years on most platforms available and in several countries around the world. Currently he works for Atlassian developing the HipChat native clients for Windows and Linux. When he does not work he like to sleep in shelters with his kids and carbonise the sausages over a fire and he does metal casting in his backyard.","isDeprecated":false,"name":"Morten Jorgensen","publicName":"","sessions":["349"],"sortGroup":"J","sortKey":"JORGE","speakerId":672},{"bio":"I am a B.Tech third year student of NIT Durgapur from Computer Science stream,  I have been contributing for KDE since last year and have been enthusiastic about FOSS ever since. ","isDeprecated":false,"name":"Rajdeep Kaur","publicName":"","sessions":["408"],"sortGroup":"K","sortKey":"KAUR","speakerId":642,"speakerImage":642},{"bio":"Stephen has been a KDE user and contributor for almost 10 years, moving through the application stack to the Frameworks and the buildsystem. This also led to contributions in Qt through the qt-project and consulting as part of KDAB.\r\n\r\nCurrently Stephen is at Ableton in Berlin working on frameworks based on Qt and QML.","isDeprecated":false,"name":"Stephen Kelly","publicName":"","sessions":["355"],"sortGroup":"K","sortKey":"KELLY","speakerId":44},{"bio":"Jean-Baptiste Kempf is the president of the VideoLAN non-profit organization and one of the lead developers of the open source VLC media player.","isDeprecated":false,"name":"Jean-Baptiste Kempf","publicName":"","sessions":["747","499"],"sortGroup":"K","sortKey":"KEMPF","speakerId":256},{"bio":"Matthias Kirschner is the President of FSFE. In 1999 he started using GNU/Linux and realised that software is deeply involved in all aspects of our lives. Matthias is convinced that this technology has to empower society not restrict it. While studying Political and Administrative Science he joined FSFE in 2004.\r\n\r\nHe helps other organisations, companies and governments to understand how they can benefit from Free Software -- which gives everybody the rights to use, understand, adapt and share software -- and how those rights help to support freedom of speech, freedom of press or privacy.\r\n\r\nMatthias loves playing with his baby son, and in his spare time assists in wilderness first aid seminars, enjoys comics like XKCD and Transmetropolitan; Monty Python and Die Ärzte.","isDeprecated":false,"name":"Matthias  Kirschner","publicName":"","sessions":["489"],"sortGroup":"K","sortKey":"KIRSC","speakerId":827,"speakerImage":827},{"bio":"","isDeprecated":false,"name":"Friedemann Kleint","publicName":"","sessions":["521","528"],"sortGroup":"K","sortKey":"KLEIN","speakerId":880},{"bio":"Andrew Knight is an active Qt contributor/Approver, former \"Troll\", and former platform maintainer of the Qt for Windows Runtime port. He currently focuses on Qt-based mobile and embedded solutions at Intopalo.","isDeprecated":false,"name":"Andrew Knight","publicName":"","sessions":["429","428"],"sortGroup":"K","sortKey":"KNIGH","speakerId":699},{"bio":"Volker started working with Qt and contributing to KDE back in 2002. He maintained KDE's personal information management service Akonadi for a few years and in 2010 he started the GammaRay project, to address the need for (by then not yet existing) QML debugging tools. Volker is a Qt approver and works as software engineer, consultant and trainer at KDAB, and leads KDAB's contributions to the Qt Automotive Suite.","isDeprecated":false,"name":"Volker Krause","publicName":"","sessions":["364"],"sortGroup":"K","sortKey":"KRAUS","speakerId":118,"speakerImage":118},{"bio":"Passionate software developer at JetBrains and marathoner.","isDeprecated":false,"name":"Victor Kropp","publicName":"","sessions":["391"],"sortGroup":"K","sortKey":"KROPP","speakerId":656},{"bio":"Chief Communications Officer\r\nHead of Open Source Solutions\r\nDeputy Chief Sales Officer\r\nBSc in Kommunikation ZFH\r\nInformatiker mit eidg. Fachausweis","isDeprecated":false,"name":"André Kunz","publicName":"","sessions":["714"],"sortGroup":"K","sortKey":"KUNZ","speakerId":1344,"speakerImage":1344},{"bio":"Kai is a Senior Manager R&D at The Qt Company. He's currently heading the WebEngine and BuildSystems team in the Berlin office of The Qt Company.","isDeprecated":false,"name":"Kai Köhne","publicName":"","sessions":["354","353","384","358"],"sortGroup":"K","sortKey":"KÖHNE","speakerId":675},{"bio":"Sebastian has been working on Plasma from its beginnings. He maintains several of the default components in Plasma, and has worked on almost all parts of it at one time or another. Sebastian has also been instrumental in setting up the KDE e.V. Marketing Working group, has served on KDE e.V.'s board of directors for several years, and has managed the releases of KDE SC throughout the KDE SC 4 series.\r\nSebastian works for Blue Systems, where he leads the team working on KDE projects. In his free time, he enjoys scuba diving, photography, travelling and likes to indulge in food and music.","isDeprecated":false,"name":"Sebastian Kügler","publicName":"","sessions":["336"],"sortGroup":"K","sortKey":"KÜGLE","speakerId":101},{"bio":"","isDeprecated":false,"name":"Felix Paul Kühne","publicName":"","sessions":["499"],"sortGroup":"K","sortKey":"KÜHNE","speakerId":251},{"bio":"Co-founder of Open-Xchange, Rafael Laguna was chairman of the board until 2008 when he became CEO. Under his guidance, Open-Xchnage extended its product offerings into SaaS and merged with open source champions Dovecot and PowerDNS.","isDeprecated":false,"name":"Rafael  Laguna","publicName":"","sessions":["581"],"sortGroup":"L","sortKey":"LAGUN","speakerId":796,"speakerImage":796},{"bio":"Michiel Leenaars (1972, Netherlands) is Director of Strategy at NLnet. He is responsible for defining and initating short term and long term policies and managing strategic activities within the NLnet foundation, and acts as its spokesperson to the press and society. He joined the management team of NLnet in 2007. He has a background in Physics at Technische Universiteit Eindhoven and Theory and history of literature/Visual and verbal communication at Tilburg University. ","isDeprecated":false,"name":"Michiel  Leenaars","publicName":"","sessions":["744"],"sortGroup":"L","sortKey":"LEENA","speakerId":1443,"speakerImage":1443},{"bio":" Johannes Loxen is founder of SerNet, a Goettingen and Berlin based company. SerNet works on information security and free software for customers worldwide. Every software released by SerNet is free and open source software. Well known projects that SerNet supports with own developers are Samba and verinice. Johannes initiated OPOSSO because no similar solution was available as free software and it was badly needed! ","isDeprecated":false,"name":"Johannes  Loxen","publicName":"","sessions":["477"],"sortGroup":"L","sortKey":"LOXEN","speakerId":806},{"bio":"","isDeprecated":false,"name":"Thiago Macieira","publicName":"","sessions":["530"],"sortGroup":"M","sortKey":"MACIE","speakerId":135},{"bio":"Polina has a LL.M in Human Rights Law and Intellectual Property Rights Law, with a focus on copyright. She is an advocate for digital rights and free culture. She joined FSFE in 2015 as a legal and policy trainee. Since 2016, she is FSFE's Policy\r\nAnalyst and Legal Coordinator.","isDeprecated":false,"name":"Polina Malaja","publicName":"","sessions":["756","753"],"sortGroup":"M","sortKey":"MALAJ","speakerId":1348},{"bio":"I started to work at Ableton (Berlin. Germany) in January 2014 and my first task was to build Qt 5.1 with Visual Studio 2013. Now I am part of the DevTools team, which creates and improves tools for the application developers, and I am in charge of how and when we update and build our Qt packages, which nowadays also include KDE's KItemModels.","isDeprecated":false,"name":"Alain Martin","publicName":"","sessions":["376"],"sortGroup":"M","sortKey":"MARTI","speakerId":689},{"bio":"Software Engineer at QNX Software Systems","isDeprecated":false,"name":"James McDonnell","publicName":"","sessions":["388"],"sortGroup":"M","sortKey":"MCDON","speakerId":655},{"bio":"Monic is one the the co-founders of freifunk.net and organizes community events, is active in refugee projects and is board member of Förderverein freie Netzwerke e.V. She works as Senior Consultant as product manager in software projects.","isDeprecated":false,"name":"Monic  Meisel","publicName":"","sessions":["457"],"sortGroup":"M","sortKey":"MEISE","speakerId":838},{"bio":"He is an artist, free software enthusiast, participation on 31c3, open tech\r\nsummit 2015, open tech summit 2016, autodidact in microcontrollers, C\r\nprogramming, assembler programming, interest (and experience to some\r\nextend) in making DIY hardware tools and machinery","isDeprecated":false,"name":"Kai Mertens","publicName":"","sessions":["736"],"sortGroup":"M","sortKey":"MERTE","speakerId":1351,"speakerImage":1351},{"bio":"I fell in love with Qt when I was a student. My first contact was with version 4.7 in a course at university. As a result of this I started participating on open source projects written in Qt in my spare time. In 2012 I started working on commercial Qt UI projects at Ergosign, one of the leading UX design- and development companies in Germany. Today I manage Qt projects for our customers, many of which are global players from all over the world.","isDeprecated":false,"name":"Friedemann Metzger","publicName":"","sessions":["360","359"],"sortGroup":"M","sortKey":"METZG","speakerId":679},{"bio":"Owner of Balearic Dynamics, a small research company, I design and create hardware and software devices for innovative applications, releasing OSHW and Open Source software products.\r\nSoftware designer and developer at NXP PLMA (Product Line Mobile Audio) in Nijmegen, The Netherlands.","isDeprecated":false,"name":"Enrico Miglino","publicName":"","sessions":["400","371"],"sortGroup":"M","sortKey":"MIGLI","speakerId":680,"speakerImage":680},{"bio":"CEO/Founder and lead software architect at EDIS Interactive. Working on, creating and developing highly interactive applications for mid and huge-sized multitouch screens. 5 years experience on Qt. A scientist to be, turned to an entrepreneur who successfully leveraged science background with visually rich elements to generate impressive applications for entertainment, museums, education and fun.","isDeprecated":false,"name":"Ariel Molina","publicName":"","sessions":["390"],"sortGroup":"M","sortKey":"MOLIN","speakerId":688},{"bio":"Sonia Montegiove is an ICT specialist and trainer and a freelance\r\njournalist and blogger on ICT themes. She is member of the coordination\r\ngroup of the LibreUmbria, Umbrian migration project to LibreOffice. She\r\nis member of TDF and she is LibreItalia President and co-founder. She is\r\nworking with LibreItalia in the project of migration to LibreOffice of\r\nItalian Minister of Defence (120.000 desktops).","isDeprecated":false,"name":"Sonia Montegiove","publicName":"","sessions":["445"],"sortGroup":"M","sortKey":"MONTE","speakerId":798},{"bio":"CTO of Westpoint Ltd (Security Testing), SSL/TLS hacker, maintainer of Qt Network and long time KDE developer.","isDeprecated":false,"name":"Richard Moore","publicName":"","sessions":["403"],"sortGroup":"M","sortKey":"MOORE","speakerId":673},{"bio":"Lydia Nardaits, 33 years, Berlin studied in Vienna with main focus on Digital Anthropology professionally working in diverse digital fields since 2008, currently for a global brand web project working for diverse NGOs and OS projects since 2004, specialized in fundraising experience in professional fundraising fo IT company on national & EU level fan and supporter of open source software and projects (especially open source web design, open CMS, Mozilla, Osmand, GIMP...) publication: Zur Konzeption einer digitalen Diaspora (ISBN-10: 3639346734) ","isDeprecated":false,"name":"Lydia  Nardaits","publicName":"","sessions":["443"],"sortGroup":"N","sortKey":"NARDA","speakerId":805},{"bio":"Katharina Nocun is a activist working on privacy and Internet freedom. She did her M.Sc. Thesis in economics on the topic of market entry options for decentralized social networks based on free software. She writes about surveillance laws and other threats for democracy in her blog kattascha.de and various German newspapers. She is also member of the advisory board of the Whistleblower Network, a Germany-based NGO that supports whistleblowers from various fields. She is also an ambassador for the The Foundation for the Rights of Future Generations (FRFG) that works on the issue of intergenerational justice in modern societies. During the last years she was leading various nation-wide campaigns on topics such as data retention, net neutrality, asylum for Edward Snowden in Germany, refugee rights and the European General Data Protection Regulation.","isDeprecated":false,"name":"Katharina   Nocun","publicName":"","sessions":["763"],"sortGroup":"N","sortKey":"NOCUN","speakerId":1474,"speakerImage":1474},{"bio":"I'm a former KDevelop, KDE developer(1998-2004), since 2004 working again in electrical engineering and industrial automation. Since 2014, restarted my involvement through Qt programming and FreeBSD ports maintenance participation in the KDE/FreeBSD initiative.","isDeprecated":false,"name":"Marie Loise Nolden","publicName":"","sessions":["369","370"],"sortGroup":"N","sortKey":"NOLDE","speakerId":684},{"bio":"Jędrzej Nowacki is a senior software engineer at The Qt Company. He started programing at the age of seven and have not stopped since. For the last few years he has worked with and for Qt, under different company names. His focus changed from QtWebkit and QtScript to QtCore and Enginio modules, to Coin (Qt continuous integration system) but still he enjoys improving different parts of Qt.","isDeprecated":false,"name":"Jędrzej Nowacki","publicName":"","sessions":["412"],"sortGroup":"N","sortKey":"NOWAC","speakerId":212},{"bio":"My name is André Ockers. I'm from Nijmegen, the Netherlands, where I've studied policy sciences. I've worked as an editor for an audio computer magazine for the blind. At home I use Free Software since 2009 and I'm a Fellow of Free Software Foundation Europe since 2014. On the 20th of May 2014 I've contacted Matthias Kirschner and since then translated for FSFE into Dutch, and later also for LibrePlanet. I've helped in FSFE booths at T-Dose Eindhoven and OpenRheinRuhr Oberhausen.","isDeprecated":false,"name":"André Ockers","publicName":"","sessions":["757"],"sortGroup":"O","sortKey":"OCKER","speakerId":924},{"bio":"Jens Ohlig works in the software development department of Wikimedia Deutschland and has been involved with Wikidata from the beginning. ","isDeprecated":false,"name":"Jens Ohlig","publicName":"","sessions":["492"],"sortGroup":"O","sortKey":"OHLIG","speakerId":819},{"bio":"Kevin Ottens has more than 10 years experience working with Qt. He is also a long term contributor of the KDE community where he focused for a long while on libraries API design and architecture. Graduating in 2007, he has a PhD in computer science which led him to focus on ontologies engineering and multi-agent systems. In 2012, he participated in the creation of the KDE Manifesto. Nowadays he spends time rethinking his job via a strong interest in software craftsmanship. Kevin's job at KDAB includes giving trainings and the responsibility of community liaison with KDE. He still lives in Toulouse where he serves as part time teacher in his former university.","isDeprecated":false,"name":"Kevin Ottens","publicName":"","sessions":["439","368"],"sortGroup":"O","sortKey":"OTTEN","speakerId":124,"speakerImage":124},{"bio":"Robert Partyka - FLOSS activist & enthusiast. Software developer & architect. Company owner. Vice-president of the board of Polish Linux Users Group (PLUG). Enthusiast of new technologies and sf&f literature. Supporter of initiatives to promote open standards and free / open source software. For many years performing lectures on FLOSS congresses about the economics of open-source software and related topics. An activist in protection of the freedom and privacy projects like Anti-ACTA movement in Poland in 2012. ","isDeprecated":false,"name":"Robert Partyka","publicName":"","sessions":["450"],"sortGroup":"P","sortKey":"PARTY","speakerId":803,"speakerImage":803},{"bio":"","isDeprecated":false,"name":"Rostislav Pehlivanov","publicName":"","sessions":["505"],"sortGroup":"P","sortKey":"PEHLI","speakerId":980},{"bio":"As the person mainly responsible for usability matters within KDE's VDG, Thomas works to keep developers, designers and his fellow usability professionals focused on our common goal: Creating the best experience possible for our users!\r\n\r\nRecently, he has taken up an additional focus: Trying to move KDE forward as a community, both in terms of helping us find a direction and in terms of communicating with the outside world.","isDeprecated":false,"name":"Thomas Pfeiffer","publicName":"","sessions":["331","334","425"],"sortGroup":"P","sortKey":"PFEIF","speakerId":88,"speakerImage":88},{"bio":"Simon Phipps is founder of Public Software CIC and a director of The Document Foundation and the Open Rights Group. He also leads UK digital rights consultancy Meshed Insights Ltd. A former OSI president, he was the executive behind releasing Java under the GPL at Sun Microsystems and has worked for IBM, Unisys, ForgeRock and Wipro. He lives in the UK.","isDeprecated":false,"name":"Simon Phipps","publicName":"","sessions":["744"],"sortGroup":"P","sortKey":"PHIPP","speakerId":1436,"speakerImage":1436},{"bio":"Lydia is the current President of KDE e.V. She is passionate about enabling people to make awesome happen around Free Software and Free Culture.","isDeprecated":false,"name":"Lydia Pintscher","publicName":"","sessions":["331","492"],"sortGroup":"P","sortKey":"PINTS","speakerId":50,"speakerImage":50},{"bio":"Professional software engineer and consultant.\r\n\r\nDaniel Pocock has developed enterprise grade solutions for some of the giants of the financial services industry, including secure connectivity for UBS (using Apache Camel), the first customer-facing WebRTC contact solution on Wall Street at Interactive Brokers, enterprise-wide real-time monitoring for Barclays Capital (based on Ganglia) and a wide range of real-time financial trade capture and risk management solutions for Thomson Reuters. Despite the highly proprietary nature of these enterprises, Pocock has remained a champion of efficient, cost effective open source solutions to meet demanding business requirements.\r\n","isDeprecated":false,"name":"Daniel Pocock","publicName":"","sessions":["448"],"sortGroup":"P","sortKey":"POCOC","speakerId":1164},{"bio":"I'm Aleix Pol Gonzalez, I've been developing KDE software for longtime, I've been sponsored to do it during the last few years by Blue Systems.\r\n\r\nI'm interested in IDE's, Education software and mostly anything that will make the world better through Open Source software and technologies.","isDeprecated":false,"name":"Aleix Pol Gonzalez","publicName":"","sessions":["386"],"sortGroup":"P","sortKey":"POL G","speakerId":16},{"bio":"Harri Porten is co-founder and co-CEO of froglogic GmbH, a company that has specialized on automated testing tools for Qt programmers. After learning about Qt through his involvement with the Open Source KDE Community Harri was working as a Senior Software Engineer at the Trolltech, the original makers of Qt in Oslo.","isDeprecated":false,"name":"Harri Porten","publicName":"","sessions":["407"],"sortGroup":"P","sortKey":"PORTE","speakerId":697},{"bio":"I have been involved in FLOSS communities since 2013, where I discovered the wonderful Mozilla Community in Albania also. As someone with a non technical background, contributing to Mozilla has been an inspiring process for me, as I was able to comprehend the vivid world of the open web, where everyone can contribute, regardless of their background.\r\n\r\nI became a Mozilla Rep in late 2015, after contributing as a Firefox Student Ambassador since 2014. I'm happy to have had the chance to co-organize Mozilla Weekend events in Berlin and TIrana, intensive 2 day events focused on onboarding new contributors at Mozilla.\r\n\r\nFurthermore, I have been part of the organizer committee of Open Source Conference Albania aka OSCAL, since the very first edition in 2014. The experience I gained throughout organizing local and regional events have helped me shape my vision as a Mozillian as well.\r\n\r\nCurrently, I study International Affairs at the European University of Tirana, Albania which comes in perfectly with my role as a community leader in the Albanian community, helping to grow participation and growth locally.\r\n","isDeprecated":false,"name":"Kristi Progri","publicName":"","sessions":["456"],"sortGroup":"P","sortKey":"PROGR","speakerId":867},{"bio":"Elio is an avid open source designer, involved at various open source & free software projects, including Mozilla, Fedora, Glucosio and GalliumOS. He is a Board Member at Open Labs Hackerspace in Tirana, Albania which promotes FLOSS since 2012. Furthermore, Elio works as a Community Manager for SitePoint, where he also writes on various topics, mostly open source. When he is not co-organizing OSCAL (Open Source Conference Albania), Elio pursues his bachelor studies at the University of Arts in Tirana, Albania. ","isDeprecated":false,"name":"Elio Qoshi","publicName":"","sessions":["491"],"sortGroup":"Q","sortKey":"QOSHI","speakerId":817},{"bio":"Co-founder of a non-profit and local ISP in France, Ilico; also Vice-president of FFDN, a federation of non-profit ISPs. ","isDeprecated":false,"name":"Julien Rabier","publicName":"","sessions":["713"],"sortGroup":"R","sortKey":"RABIE","speakerId":916},{"bio":"","isDeprecated":false,"name":"Pradeep Ramachandran","publicName":"","sessions":["516"],"sortGroup":"R","sortKey":"RAMAC","speakerId":1011},{"bio":"Julia Reda was elected to the European Parliament for the Pirate Party in 2014. She is a Vice-Chair of her parliamentary group, the Greens/European Free Alliance. In the European Parliament, she serves as a coordinator for the Greens/EFA in the Committee on Internal Market & Consumer Protection (IMCO), as a member of the Legal Affairs (JURI) and Petition (PETI) Committees and was elected to the Enquiry Committee on the Emissions Scandal (\"Dieselgate\"). She co-founded the Digital Agenda intergroup. Her legislative focus is on copyright and internet policy issues. In 2015, she was responsible for the Parliament's evaluation of the Copyright Directive.\r\n\r\nBorn in Bonn in 1986, Julia Reda was a member of the German Social Democrats for six years before joining the Piratenpartei in 2009 amidst a debate on internet blocking. She served as chairwoman of the party's youth wing from 2010 to 2012 and is a founder of the Young Pirates of Europe. She holds an M.A. in political science and communications science from Johannes-Gutenberg-University Mainz, Germany.\r\n\r\nThe global Pirate Party movement was born in 2006. Pirates, who believe in using technology for the empowerment of all, have so far enjoyed significant electoral success in Sweden, Germany, Iceland and the Czech Republic and have raised the visibility of their techno-progressive agenda across Europe.","isDeprecated":false,"name":"Julia  Reda","publicName":"","sessions":["520"],"sortGroup":"R","sortKey":"REDA","speakerId":1387,"speakerImage":1387},{"bio":"Ralf Peter Reimann has studied computer science and Protestant theology. He is working as web team leader of the Evangelical Church in the Rhineland. He was president of the European Christian Internet Conference and he is secretary of the Word Association of Christian Communication Europe Region and blogs at theonet.de.","isDeprecated":false,"name":"Ralf Peter  Reimann","publicName":"","sessions":["463"],"sortGroup":"R","sortKey":"REIMA","speakerId":815,"speakerImage":815},{"bio":"19 years old computer science student at INSA Toulouse, I've been crazy about programming and free softwares since my youngest age. I already created several open-source embedded projects like a Qt4 Desktop Environment, an x86 experimental kernel, a quadcopter autopilot and ground control station and a FOSS OS for smartwatches.","isDeprecated":false,"name":"Florent Revest","publicName":"","sessions":["366"],"sortGroup":"R","sortKey":"REVES","speakerId":683,"speakerImage":683},{"bio":"Stefan started programming in 1983 and founded his company freiheit.com technologies in 1999 because he “wanted to write code all the time”. His first task in his newly founded company was the installation of GNU/Linux on a new laptop; he was then heading out to build software that would run only in browsers, which used a Unix/Linux backend. As almost everyone was using Windows at that time, he gave his best to convince other people to move over to the free software side, too. In 2003, he became a volunteer and donor for the FSFE and an activist against proprietary software. ","isDeprecated":false,"name":"Stefan Richter","publicName":"","sessions":["475"],"sortGroup":"R","sortKey":"RICHT","speakerId":801,"speakerImage":801},{"bio":"Jonathan is an international freedom fighter, battling the forces of tyranny and repression through the medium of KDE software.\r\n","isDeprecated":false,"name":"Jonathan Riddell","publicName":"","sessions":["385"],"sortGroup":"R","sortKey":"RIDDE","speakerId":145},{"bio":"Qt Quick maintainer, trying to focus on better support for pointing devices: tablets, touchscreens and mice.  End up doing a lot of other things with Qt.","isDeprecated":false,"name":"Shawn Rutledge","publicName":"","sessions":["333"],"sortGroup":"R","sortKey":"RUTLE","speakerId":663},{"bio":"Marta Rybczynska has network security background and 10 years of experience in embedded development. She has been working with embedded operating systems like Linux and various real-time ones, system libraries and frameworks up to user interfaces. Currently she is working at Kalray on the device drivers and operating systems on the massive multicore MPPA256 platform. Her other activites include contribution to KDE where she is Vice-President and Treasurer of KDE e.V. She has experience with presentations on both scientific and free software conferences and is interested in public speaking.","isDeprecated":false,"name":"Marta Rybczyńska","publicName":"","sessions":["337","338"],"sortGroup":"R","sortKey":"RYBCZ","speakerId":89},{"bio":"Michael Schloh von Bennewitz is a computer scientist specializing in network engineering, embedded design, and mobile platform development. Responsible for research, development, and maintenance of packages in several community software repositories, he actively contributes to the Opensource development community.\r\n\r\nMichael speaks four languages fluently and presents at technical events every year. He has presented for groups including Cable & Wireless, Nokia, Mozilla, Ubuntu, ARIN, Droidcon, AstriCon, Minix, the Mobile World Congress, and Dockercon. His speaking style is humorous, using gestures and good eye contact, and he writes public online slide decks in HTML5.\r\n\r\nMichael's IoT knowledge profits from years of work at telecoms and relationships with industry leaders. He is a Intel innovator, Samsung partner, and Mozilla contributor with the mandate to promote IoT technology.\r\n\r\nAdditional information is found at http://michael.schloh.com/","isDeprecated":false,"name":"Michael Schloh von Bennewitz","publicName":"","sessions":["431"],"sortGroup":"S","sortKey":"SCHLO","speakerId":703},{"bio":"Arno holds a PhD in Computer Vision from the Georgia Institute of Technology (2002), and is founder and Technical Director of think-cell Software GmbH in Berlin. The company develops think-cell chart, a charting and presentation software written in more than 1 million lines of C++. Recently, think-cell became the key sponsor of the computer language group at DIN, the German Institute for Standardization, and is now participating in the C++ standardization effort at the International Organization for Standardization (ISO).","isDeprecated":false,"name":"Arno Schoedl","publicName":"","sessions":["438"],"sortGroup":"S","sortKey":"SCHOE","speakerId":712,"speakerImage":712},{"bio":" I am a linguist by training and a free software enthusiast ever since I started coding. Since 2015 I am also a fellow of the FSFE. I have been working at both technical and non-technical universities for several years. In this time I have experienced a wide array of different attitudes towards software and software freedom. Moreover, together with some of my colleagues I formed a working group for free software at my current lab. ","isDeprecated":false,"name":"Tobias  Schrank","publicName":"","sessions":["582"],"sortGroup":"S","sortKey":"SCHRA","speakerId":814},{"bio":"Cornelius found Qt in 1998 and fell in love with it. This lead him to KDE, where he stuck around until today. He has written lots of code, maintained applications, and worked on a variety of projects and initiatives. He served on the board of KDE e.V. for nine years. He also is involved in other communities, such as openSUSE, Qt, ownCloud, and makes a point of fostering collaboration between projects and communities. In his day job Cornelius works for SUSE as an engineering manager.\r\n","isDeprecated":false,"name":"Cornelius Schumacher","publicName":"","sessions":["325"],"sortGroup":"S","sortKey":"SCHUM","speakerId":42},{"bio":"","isDeprecated":false,"name":"Bhushan Shah","publicName":"","sessions":["330","399"],"sortGroup":"S","sortKey":"SHAH","speakerId":371},{"bio":"6+ years in the UN/ITU setting up their first platform for social entrepreneurs using tech in innovative ways and now manager of Ashoka Digital, a program for the world´s biggest network of social entrepreneurs with a new focus on digital visionaries. Apart from setting up these programs bringing the two very remote worlds together, I also gathered years of hands-on experience working with the innovators ","isDeprecated":false,"name":"Regina  Sipos","publicName":"","sessions":["482"],"sortGroup":"S","sortKey":"SIPOS","speakerId":800},{"bio":"Reginald co-founded froglogic, the creator of the Squish GUI testing tool with special support for automating Qt/QML GUI tests and Squish Coco, the code coverage analysis tool for C, C++, C#, Tcl and QML/JS. \r\n\r\nBefore founding froglogic, Reginald worked as Senior Software Engineer at Trolltech, the original makers of Qt. \r\n\r\nToday Reginald is involved in all aspects of the Squish product as co-CEO of the company.","isDeprecated":false,"name":"Reginald Stadlbauer","publicName":"","sessions":["344"],"sortGroup":"S","sortKey":"STADL","speakerId":670},{"bio":"Morten Johan Sørvig has contributed to the high-DPI support in Qt.","isDeprecated":false,"name":"Morten Sørvig","publicName":"","sessions":["432","433"],"sortGroup":"S","sortKey":"SØRVI","speakerId":704},{"bio":"","isDeprecated":false,"name":"Timothy Terriberry","publicName":"","sessions":["506"],"sortGroup":"T","sortKey":"TERRI","speakerId":992},{"bio":"Johan Thelin has worked with Qt for more than 10 years and is the author of the Foundations of Qt Development.","isDeprecated":false,"name":"Johan Thelin","publicName":"","sessions":["411"],"sortGroup":"T","sortKey":"THELI","speakerId":698,"speakerImage":698},{"bio":"","isDeprecated":false,"name":"Michael Tims","publicName":"","sessions":["379"],"sortGroup":"T","sortKey":"TIMS","speakerId":826},{"bio":" Sam is an Open Source entrepreneur, developer, & CEO of phpList. He's managed marketing for LibreOffice & Collabora, executed campaigns for the Free Software Foundation Europe and Gnu Privacy Guard (GnuPG), and engineered systems for ownCloud. ","isDeprecated":false,"name":"Sam Tuke","publicName":"","sessions":["444"],"sortGroup":"T","sortKey":"TUKE","speakerId":807},{"bio":"Stephan „tomate“ Urbach works for the Renewable Freedom Foundation as a project lead. Before he was involved in Telecomix and other internet freedom projects. He is always en route and on the run. At the moment he lives with his dog in Berlin. ","isDeprecated":false,"name":"Stephan Urbach","publicName":"","sessions":["744"],"sortGroup":"U","sortKey":"URBAC","speakerId":1115,"speakerImage":1115},{"bio":"","isDeprecated":false,"name":"Nasir  Usman Imam","publicName":"","sessions":["426"],"sortGroup":"U","sortKey":"USMAN","speakerId":701},{"bio":"Jos is a KDE contributor since 2005 and has worked in Calligra (previously KOffice), WebODF and Strigi. Jos is the KDE representative for the OpenDocument Format at OASIS.\r\n","isDeprecated":false,"name":"Jos van den Oever","publicName":"","sessions":["419","416"],"sortGroup":"V","sortKey":"VAN D","speakerId":341},{"bio":"Walter has a background in both information management and law. His day job is drafting IT-contracts and negotiating them. By night he moonlights as a volunteer for Vrijschrift and is their liaison to EDRi, European Digital Rights, a European umbrella for NGOs in the field of digital rights. His Twitter handle is @whvholst.","isDeprecated":false,"name":"Walter  Van Holst ","publicName":"","sessions":["459"],"sortGroup":"V","sortKey":"VAN H","speakerId":822},{"bio":"BogDan Vatra is a Software Engineer at KDAB and has been using Qt since 2002 and is the original author of Qt for Android port and the maintainer of this platform.","isDeprecated":false,"name":"BogDan Vatra","publicName":"","sessions":["405"],"sortGroup":"V","sortKey":"VATRA","speakerId":692},{"bio":"Ken Vermette is a designer and developer from Canada who was unwittingly sucked into the KDE VDG.","isDeprecated":false,"name":"Ken Vermette","publicName":"","sessions":["332"],"sortGroup":"V","sortKey":"VERME","speakerId":566,"speakerImage":566},{"bio":" Italo Vignoli is a founder and a team member of The Document Foundation, with responsibility for marketing and communication. He is also a spokesman for the project. In 2014, he has founded Associazione LibreItalia, the not for profit which represents the Italian LibreOffice community. In 2016 he has been elected to the OSI board of directors. Italo is a communications consultant with thirty years of experience in the field of high technologies, a member of Ferpi - the Italian Association of Public Relation Professionals - and a visiting professor of high tech marketing, public speaking and public relations in universities and post-graduate courses. Italo has a Degree in Humanities at the University of Milan, and Master Degrees in Marketing, Public Relations and Journalism at different US and Italian universities. ","isDeprecated":false,"name":"Italo Vignoli","publicName":"","sessions":["490"],"sortGroup":"V","sortKey":"VIGNO","speakerId":810},{"bio":"Daniel is a software engineer at KDAB and an active KDE contributor. In KDE he works primarily on the KDE PIM. Daniel also contributes to the Fedora distribution as co-maintainer of the KDE stack.","isDeprecated":false,"name":"Daniel Vrátil","publicName":"","sessions":["365"],"sortGroup":"V","sortKey":"VRÁTI","speakerId":17,"speakerImage":17},{"bio":"I work at KDAB as a Software Engineer and contribute to KDE for quite some years now. I am one of the most active contributors to KDevelop and Kate. Tooling in general is of huge interest to me, I wrote the Massif-Visualizer and more recently heaptrack to aid developers in improving the memory consumption of their applications. Additionally, I started to contribute to Linux perf. At KDAB I also worked on GammaRay which is invaluable to any Qt developer. Recently, I also started training developers in the art of debugging and profiling software with various tools.","isDeprecated":false,"name":"Milian Wolff","publicName":"","sessions":["352"],"sortGroup":"W","sortKey":"WOLFF","speakerId":22},{"bio":"","isDeprecated":false,"name":"Michal Wozniak","publicName":"","sessions":["465"],"sortGroup":"W","sortKey":"WOZNI","speakerId":831,"speakerImage":831},{"bio":"Simon Wächter is a software developer and lives in Basel and is highly interested in IT security and Free Software. He is the new FSFE coordinator for Switzerland and reestablished the local group in Zurich.","isDeprecated":false,"name":"Simon Wächter","publicName":"","sessions":["723"],"sortGroup":"W","sortKey":"WÄCHT","speakerId":1356,"speakerImage":1356},{"bio":"","isDeprecated":false,"name":" Johannes Zarl-Zierl","publicName":"","sessions":["760"],"sortGroup":"Z","sortKey":"ZARL-","speakerId":1449},{"bio":"Have been a long time KDE contributor mainly working on the Plasma workspace, and lower-level frameworks for tracking and predicting the user actions.\r\n\r\nLately, a vocal evangelist regarding the use of the new C++11 features, as well as older seldomly known C++ idioms, for cleaner and safer development practices throughout the KDE community.","isDeprecated":false,"name":"Ivan Čukić","publicName":"","sessions":["380"],"sortGroup":"Č","sortKey":"ČUKIĆ","speakerId":155,"speakerImage":155},{"bio":"Lawyer, geek, GNU/Linux user since 1997. Long-standing active member of various communities in and around FOSS – including Cyberpipe hackerspace, \r\nLinux User Group of Slovenia, Free Software Foundation Europe, KDE, Internet \r\nGovernance Forum Slovenia, etc.\r\n ","isDeprecated":false,"name":"Matija  Šuklje","publicName":"","sessions":["744","756"],"sortGroup":"Š","sortKey":"ŠUKLJ","speakerId":1347,"speakerImage":1347}]